DataProcessors/омг_МониторРуководителя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>омг_МониторРуководителя</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/омг_ПоказателиДляМонитораРуководителя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>омг_ПоказателиДляМонитораРуководителя</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Показатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоказателиПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Разрез</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипУслуги</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МедицинскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/омг_МониторРуководителя/Forms/Форма85/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Месяц = НачалоМесяца(ТекущаяДата());
	НачалоГода = НачалоГода(ТекущаяДата());
	КонецГода = КонецГода(ТекущаяДата());
	УстановитьПериод(Неопределено, Неопределено, "Месяц");
	ПоВсейГруппеКомпаний = Истина;
	ПоФилиалу = Ложь;
	ПоМедицинскомуЦентру = Ложь;
	ВыборМесяц = Истина;
	ВыборКвартал = Ложь;
	ВыборПолугодие = Ложь;
	ВыборГод = Ложь;
	ПроизвольныйПериод = Ложь;
	ПризнакГрафикДоходов = Истина;
	ПризнакГрафикСрЧеки = Ложь;
	ОбновитьВидимостьЭлементов();
	ОбновитьВидимостьГрафиков();
	ОбновитьПодсветкуЭлементов();
	Элементы.ВерхняяЧастьОП.Видимость = Ложь;
	Элементы.НижняяЧастьОП.Видимость = Ложь;
	Элементы.СтатистическиеДанные.Видимость = Ложь;
	Элементы.АналитикаКлиентскойБазы.Видимость = Ложь;
	ПризнакГрафикДоходыГлав = Истина;
КонецПроцедуры 

&НаКлиенте
Процедура ОбновитьВидимостьЭлементов()
	Если ПоФилиалу = Истина Тогда
		Элементы.Филиал.Видимость = Истина;
	Иначе
		Элементы.Филиал.Видимость = Ложь;
	КонецЕсли;
	///////////////
	Если ПоМедицинскомуЦентру = Истина Тогда
		Элементы.МедицинскийЦентр.Видимость = Истина;
	Иначе
		Элементы.МедицинскийЦентр.Видимость = Ложь;
	КонецЕсли;
	///////////////
	Если ВыборМесяц = Истина Тогда
		IКвартал = Ложь;
		IIКвартал = Ложь;
		IIIКвартал = Ложь;
		IVКвартал = Ложь;
		IПолугодие = Ложь;
		IIПолугодие = Ложь;
		Элементы.ГруппаМесяц.Видимость = Истина;
	Иначе
		Элементы.ГруппаМесяц.Видимость = Ложь;
	КонецЕсли;
	///////////////
	Если ВыборКвартал = Истина Тогда
		IПолугодие = Ложь;
		IIПолугодие = Ложь;
		Элементы.ГруппаКвартал.Видимость = Истина;
		
	Иначе
		Элементы.ГруппаКвартал.Видимость = Ложь;
	КонецЕсли;
	///////////////
	Если ВыборПолугодие = Истина Тогда
		IКвартал = Ложь;
		IIКвартал = Ложь;
		IIIКвартал = Ложь;
		IVКвартал = Ложь;
		Элементы.ГруппаПолугодие.Видимость = Истина;
	Иначе
		Элементы.ГруппаПолугодие.Видимость = Ложь;
	КонецЕсли;
	///////////////
	Если ПроизвольныйПериод = Истина Тогда
		IКвартал = Ложь;
		IIКвартал = Ложь;
		IIIКвартал = Ложь;
		IVКвартал = Ложь;
		IПолугодие = Ложь;
		IIПолугодие = Ложь;	
		Элементы.ГруппаПроизвольный.Видимость = Истина;
	Иначе
		Элементы.ГруппаПроизвольный.Видимость = Ложь;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПодсветкуЭлементов()
	Если ПоВсейГруппеКомпаний = Истина Тогда
		Элементы.ПоВсейГруппеКомпаний.ЦветФона = WebЦвета.Желтый;
	Иначе
		Элементы.ПоВсейГруппеКомпаний.ЦветФона = Новый Цвет();
	КонецЕсли;
	///////////////
	Если ПоФилиалу = Истина Тогда
		Элементы.ПоФилиалу.ЦветФона = WebЦвета.Желтый;
	Иначе
		Элементы.ПоФилиалу.ЦветФона = Новый Цвет();
	КонецЕсли;
	///////////////
	Если ПоМедицинскомуЦентру = Истина Тогда
		Элементы.ПоМедицинскомуЦентру.ЦветФона = WebЦвета.Желтый;
	Иначе
		Элементы.ПоМедицинскомуЦентру.ЦветФона = Новый Цвет();
	КонецЕсли;
	///////////////
	Если ВыборМесяц = Истина Тогда
		Элементы.ВыборМесяц.ЦветФона = WebЦвета.Желтый;
	Иначе
		Элементы.ВыборМесяц.ЦветФона = Новый Цвет();
	КонецЕсли;
	///////////////
	Если ВыборКвартал = Истина Тогда
		Элементы.ВыборКвартал.ЦветФона = WebЦвета.Желтый;
	Иначе
		Элементы.ВыборКвартал.ЦветФона = Новый Цвет();
	КонецЕсли;
	///////////////
	Если ВыборПолугодие = Истина Тогда
		Элементы.ВыборПолугодие.ЦветФона = WebЦвета.Желтый;
	Иначе
		Элементы.ВыборПолугодие.ЦветФона = Новый Цвет();
	КонецЕсли;
	Если ВыборГод = Истина Тогда
		Элементы.ВыборГод.ЦветФона = WebЦвета.Желтый;
	Иначе
		Элементы.ВыборГод.ЦветФона = Новый Цвет();
	КонецЕсли;
	///////////////
	Если ПроизвольныйПериод = Истина Тогда
		Элементы.ПроизвольныйПериод.ЦветФона = WebЦвета.Желтый;
	Иначе
		Элементы.ПроизвольныйПериод.ЦветФона = Новый Цвет();
	КонецЕсли; 
	///////////////
	Если IКвартал = Истина Тогда
		Элементы.IКвартал.ЦветФона = WebЦвета.Желтый;
	Иначе
		Элементы.IКвартал.ЦветФона = Новый Цвет();
	КонецЕсли;
	///////////////
	Если IIКвартал = Истина Тогда
		Элементы.IIКвартал.ЦветФона = WebЦвета.Желтый;
	Иначе
		Элементы.IIКвартал.ЦветФона = Новый Цвет();
	КонецЕсли;
	///////////////
	Если IIIКвартал = Истина Тогда
		Элементы.IIIКвартал.ЦветФона = WebЦвета.Желтый;
	Иначе
		Элементы.IIIКвартал.ЦветФона = Новый Цвет();
	КонецЕсли;
	///////////////
	Если IVКвартал = Истина Тогда
		Элементы.IVКвартал.ЦветФона = WebЦвета.Желтый;
	Иначе
		Элементы.IVКвартал.ЦветФона = Новый Цвет();
	КонецЕсли;
	///////////////
	Если IПолугодие = Истина Тогда
		Элементы.IПолугодие.ЦветФона = WebЦвета.Желтый;
	Иначе
		Элементы.IПолугодие.ЦветФона = Новый Цвет();
	КонецЕсли;
	///////////////
	Если IIПолугодие = Истина Тогда
		Элементы.IIПолугодие.ЦветФона = WebЦвета.Желтый;
	Иначе
		Элементы.IIПолугодие.ЦветФона = Новый Цвет();
	КонецЕсли;
	///////////////
	Если ПризнакГрафикДоходов = Истина Тогда
		Элементы.КомандаГрафикДоходов.ЦветФона = WebЦвета.Желтый;
	Иначе
		Элементы.КомандаГрафикДоходов.ЦветФона = Новый Цвет();
	КонецЕсли;
	///////////////
	Если ПризнакГрафикСрЧеки = Истина Тогда
		Элементы.КомандаСредниеЧеки.ЦветФона = WebЦвета.Желтый;
	Иначе                                                           
		Элементы.КомандаСредниеЧеки.ЦветФона = Новый Цвет();
	КонецЕсли;
	///////////////
	Если ПризнакАналитикаПоПациентам = Истина Тогда
		Элементы.ГрафикАналитикаПациентов.ЦветФона = WebЦвета.Желтый;
	Иначе                                                           
		Элементы.ГрафикАналитикаПациентов.ЦветФона = Новый Цвет();
	КонецЕсли;
	///////////////
	Если ПризнакГрафикДоходыГлав = Истина Тогда
		Элементы.КомандаГрафикДоходыГлав.ЦветФона = WebЦвета.Желтый;
	Иначе                                                           
		Элементы.КомандаГрафикДоходыГлав.ЦветФона = Новый Цвет();
	КонецЕсли;
	///////////////
	Если ПризнакГрафикСреднийЧекГлав = Истина Тогда
		Элементы.КомандаГрафикСреднийЧекГлав.ЦветФона = WebЦвета.Желтый;
	Иначе                                                           
		Элементы.КомандаГрафикСреднийЧекГлав.ЦветФона = Новый Цвет();
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьГрафиков()
	Если ПризнакГрафикДоходов = Истина Тогда
		Элементы.ГрафикДоходов.Видимость = Истина
	Иначе
		Элементы.ГрафикДоходов.Видимость = Ложь
	КонецЕсли;
	////////////////////
	Если ПризнакГрафикСрЧеки = Истина Тогда
		Элементы.ГрафикСреднийЧек.Видимость = Истина
	Иначе
		Элементы.ГрафикСреднийЧек.Видимость = Ложь
	КонецЕсли;
	////////////////////
	Если ПризнакАналитикаПоПациентам = Истина Тогда
		Элементы.ГрафикПосещенийИПациентовИПостоянных.Видимость = Истина;
		Элементы.ГрафикПроцентовПовторныхПациентовИПостоянных.Видимость = Истина;
		Если ПоВсейГруппеКомпаний Тогда
			Элементы.ФилиалДляАналитикиПоПациентам.Видимость = Истина;
			Элементы.МедицинскийЦентрДляАналитикиПоПациентам.Видимость = Ложь;
			
		ИначеЕсли ПоФилиалу Тогда
			Элементы.ФилиалДляАналитикиПоПациентам.Видимость = Ложь;
			Элементы.МедицинскийЦентрДляАналитикиПоПациентам.Видимость = Истина;
		КонецЕсли;
	Иначе
		Элементы.ГрафикПосещенийИПациентовИПостоянных.Видимость = Ложь;
		Элементы.ГрафикПроцентовПовторныхПациентовИПостоянных.Видимость = Ложь;
		Элементы.ФилиалДляАналитикиПоПациентам.Видимость = Ложь;
		Элементы.МедицинскийЦентрДляАналитикиПоПациентам.Видимость = Ложь;
		
	КонецЕсли;
	////////////////////
	Если ПризнакГрафикДоходыГлав = Истина Тогда
		Элементы.ГрафикДоходыГлав.Видимость = Истина
	Иначе
		Элементы.ГрафикДоходыГлав.Видимость = Ложь
	КонецЕсли;
	////////////////////
	Если ПризнакГрафикСреднийЧекГлав = Истина Тогда
		Элементы.ГрафикСреднийЧекГлав.Видимость = Истина
	Иначе
		Элементы.ГрафикСреднийЧекГлав.Видимость = Ложь
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьГруппПриИзмененииНастроек()
	Элементы.ВерхняяЧастьОП.Видимость = Истина;
	Элементы.НижняяЧастьОП.Видимость = Истина;
	Элементы.АналитикаКлиентскойБазы.Видимость = Истина;
	Элементы.СтатистическиеДанные.Видимость = Истина;
	
	Если ВыборМесяц = Истина Тогда
		Элементы.ГруппаГрафикиДоходыИСреднийЧек.Видимость = Ложь;
		Элементы.ГруппаМесячныхПоказателей.Видимость = Истина;
		Элементы.ДоляУслугВВыручкеДлительныйПериод.Видимость = Ложь;
		Элементы.ДоляУслугВВыручке.Видимость = Истина;
		Элементы.ГрафикПервичныхПовторныхПриемовВПериоде.Видимость = Ложь;
		
	Иначе
		Элементы.ДоляУслугВВыручкеДлительныйПериод.Видимость = Истина;
		Элементы.ДоляУслугВВыручке.Видимость = Ложь;
		Элементы.ГрафикПервичныхПовторныхПриемовВПериоде.Видимость = Истина;

		
	КонецЕсли;
	///////////////
	Если ВыборКвартал = Истина Тогда
		Элементы.ГруппаГрафикиДоходыИСреднийЧек.Видимость = Истина;
		Элементы.ГруппаМесячныхПоказателей.Видимость = Ложь;
		
	Иначе
	КонецЕсли;
	///////////////
	Если ВыборПолугодие = Истина Тогда
		Элементы.ГруппаГрафикиДоходыИСреднийЧек.Видимость = Истина;
		Элементы.ГруппаМесячныхПоказателей.Видимость = Ложь;
		
	Иначе
	КонецЕсли;
	///////////////
	Если ВыборГод = Истина Тогда
		Элементы.ГруппаГрафикиДоходыИСреднийЧек.Видимость = Истина;
		Элементы.ГруппаМесячныхПоказателей.Видимость = Ложь;
		
	Иначе
	КонецЕсли;

	///////////////
	Если ПроизвольныйПериод = Истина Тогда
		Элементы.ГруппаГрафикиДоходыИСреднийЧек.Видимость = Истина;
		Элементы.ГруппаМесячныхПоказателей.Видимость = Ложь;
		
	Иначе
	КонецЕсли;
	/////////////////
	Если ПоВсейГруппеКомпаний Тогда
		Элементы.НадписьДляФилиалов.Видимость = Истина;
		Элементы.НадписьДляМедЦентров.Видимость = Ложь;
		Элементы.КомандаГрафикДоходов.Видимость = Истина;
		//Элементы.ГрафикДоходов.Видимость = Истина;
		Элементы.КомандаСредниеЧеки.Видимость = Истина;
		//Элементы.ГрафикСреднийЧек.Видимость = Истина;
		ПризнакГрафикДоходов = Истина;
		ПризнакГрафикСрЧеки = Ложь;
		ПризнакАналитикаПоПациентам = Ложь;
	КонецЕсли;
	/////////////////
	Если ПоФилиалу = Истина Тогда
		Элементы.НадписьДляФилиалов.Видимость = Ложь;
		Элементы.НадписьДляМедЦентров.Видимость = Истина;
		Элементы.КомандаГрафикДоходов.Видимость = Истина;
		//Элементы.ГрафикДоходов.Видимость = Истина;
		Элементы.КомандаСредниеЧеки.Видимость = Истина;
		//Элементы.ГрафикСреднийЧек.Видимость = Истина;
		ПризнакГрафикДоходов = Истина;
		ПризнакГрафикСрЧеки = Ложь;
		ПризнакАналитикаПоПациентам = Ложь;
	КонецЕсли;
	///////////////
	Если ПоМедицинскомуЦентру = Истина Тогда
		Элементы.НадписьДляФилиалов.Видимость = Ложь;
		Элементы.НадписьДляМедЦентров.Видимость = Ложь;
		Элементы.КомандаГрафикДоходов.Видимость = Ложь;
		//Элементы.ГрафикДоходов.Видимость = Ложь;
		Элементы.КомандаСредниеЧеки.Видимость = Ложь;
		//Элементы.ГрафикСреднийЧек.Видимость = Ложь;
		ПризнакГрафикДоходов = Ложь;
		ПризнакГрафикСрЧеки = Ложь;
		ПризнакАналитикаПоПациентам = Истина;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцРегулирование(Элемент, Направление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Попытка
		Месяц = НачалоМесяца(ДобавитьМесяц(Месяц, Направление));
	Исключение
	КонецПопытки;
	Модифицированность = Истина;
	УстановитьПериод(Неопределено, Неопределено, "Месяц");
КонецПроцедуры

&НаКлиенте
Процедура МесяцПриИзменении(Элемент)
	Месяц = НачалоМесяца(Месяц);
	УстановитьПериод(Неопределено, Неопределено, "Месяц");
КонецПроцедуры

&НаКлиенте
Процедура ВыборМесяц(Команда)
	Месяц = НачалоМесяца(ТекущаяДата());
	ВыборМесяц = Истина;
	ВыборКвартал = Ложь;
	ВыборПолугодие = Ложь; 
	ВыборГод = Ложь;
	ПроизвольныйПериод = Ложь;
	ОбновитьВидимостьЭлементов();
	ОбновитьПодсветкуЭлементов()
КонецПроцедуры

&НаКлиенте
Процедура ВыборКвартал(Команда)
	ВыборМесяц = Ложь;
	ВыборКвартал = Истина;
	ВыборПолугодие = Ложь; 
	ВыборГод = Ложь;
	ПроизвольныйПериод = Ложь;
	ОбновитьВидимостьЭлементов();
	ОбновитьПодсветкуЭлементов()
КонецПроцедуры

&НаКлиенте
Процедура ВыборПолугодие(Команда)
	ВыборМесяц = Ложь;
	ВыборКвартал = Ложь;
	ВыборПолугодие = Истина; 
	ВыборГод = Ложь;
	ПроизвольныйПериод = Ложь;
	ОбновитьВидимостьЭлементов();
	ОбновитьПодсветкуЭлементов()
КонецПроцедуры

&НаКлиенте
Процедура ВыборГод(Команда)
	УстановитьПериод(Неопределено, Неопределено, "Год");
	ВыборМесяц = Ложь;
	ВыборКвартал = Ложь;
	ВыборПолугодие = Ложь; 
	ВыборГод = Истина;
	ПроизвольныйПериод = Ложь;
	ОбновитьВидимостьЭлементов();
	ОбновитьПодсветкуЭлементов()
КонецПроцедуры

&НаКлиенте
Процедура ПроизвольныйПериод(Команда)
	ВыборМесяц = Ложь;
	ВыборКвартал = Ложь;
	ВыборПолугодие = Ложь; 
	ВыборГод = Ложь;
	ПроизвольныйПериод = Истина;
	ОбновитьВидимостьЭлементов();
	ОбновитьПодсветкуЭлементов()
КонецПроцедуры

&НаКлиенте
Процедура ПоВсейГруппеКомпаний(Команда)
	ПоВсейГруппеКомпаний = Истина;
	ПоФилиалу = Ложь;
	ПоМедицинскомуЦентру = Ложь;
	Филиал = "";
	МедицинскийЦентр = "";
	ФилиалДляАналитикиПоПациентам = "";
	МедицинскийЦентрДляАналитикиПоПациентам = "";
	ОбновитьВидимостьЭлементов();
	ОбновитьПодсветкуЭлементов();
	ОбновитьВидимостьГрафиков();
КонецПроцедуры
&НаКлиенте
Процедура МедицинскийЦентрПриИзменении(Элемент)
	ЗаполнитьФилиалМедЦентра();
	МедицинскийЦентрДляАналитикиПоПациентам = МедицинскийЦентр;
КонецПроцедуры
&НаКлиенте
Процедура ФилиалПриИзменении(Элемент)
	ФилиалДляАналитикиПоПациентам = Филиал;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФилиалМедЦентра()
	Филиал = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(МедицинскийЦентр,"Организация");
КонецПроцедуры

&НаКлиенте
Процедура ПоФилиалу(Команда)
	ПоВсейГруппеКомпаний = Ложь;
	ПоФилиалу = Истина;
	ПоМедицинскомуЦентру = Ложь; 
	Филиал = "";
	МедицинскийЦентр = "";
	ФилиалДляАналитикиПоПациентам = "";
	МедицинскийЦентрДляАналитикиПоПациентам = "";
	ОбновитьВидимостьЭлементов();
	ОбновитьПодсветкуЭлементов();
	ОбновитьВидимостьГрафиков();
КонецПроцедуры

&НаКлиенте
Процедура ПоМедицинскомуЦентру(Команда)
	ПоВсейГруппеКомпаний = Ложь;
	ПоФилиалу = Ложь;
	ПоМедицинскомуЦентру = Истина;
	Филиал = "";
	МедицинскийЦентр = "";
	ФилиалДляАналитикиПоПациентам = "";
	МедицинскийЦентрДляАналитикиПоПациентам = "";
	МедицинскийЦентр = "";
	ОбновитьВидимостьЭлементов();
	ОбновитьПодсветкуЭлементов();
	ОбновитьВидимостьГрафиков();
КонецПроцедуры 

Процедура УстановитьПериод(НомерКвартала, НомерПолугодия, ТипПериода)
	
	ТекущийГод = Год(ТекущаяДата());
	Если ТипПериода = "Квартал" Тогда
		НачальныйМесяц = (НомерКвартала - 1) * 3 + 1;
		НачалоПериода = Дата(ТекущийГод, НачальныйМесяц, 1);
		КонечныйМесяц = НачальныйМесяц + 2;
		КонецПериода = КонецМесяца(Дата(ТекущийГод, КонечныйМесяц, 1));
	ИначеЕсли
		ТипПериода = "Полугодие" Тогда
		НачальныйМесяц = (НомерПолугодия - 1) * 6 + 1;
		НачалоПериода = Дата(ТекущийГод, НачальныйМесяц, 1);
		КонечныйМесяц = НачальныйМесяц + 5;
		КонецПериода = КонецМесяца(Дата(ТекущийГод, КонечныйМесяц, 1));
	ИначеЕсли
		ТипПериода = "Месяц" Тогда
		НачалоПериода = НачалоМесяца(Месяц);
		КонецПериода = КонецМесяца(Месяц);
	ИначеЕсли
		ТипПериода = "Год" Тогда
		НачалоПериода = НачалоГода(ТекущаяДата());
		КонецПериода = КонецГода(ТекущаяДата());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура IКвартал(Команда)
	IКвартал = Истина;
	IIКвартал = Ложь;
	IIIКвартал = Ложь;
	IVКвартал = Ложь;
	УстановитьПериод(1, Неопределено, "Квартал");
	ОбновитьПодсветкуЭлементов()
КонецПроцедуры

&НаКлиенте
Процедура IIКвартал(Команда)
	IКвартал = Ложь;
	IIКвартал = Истина;
	IIIКвартал = Ложь;
	IVКвартал = Ложь;
	УстановитьПериод(2, Неопределено, "Квартал");
	ОбновитьПодсветкуЭлементов()
КонецПроцедуры

&НаКлиенте
Процедура IIIКвартал(Команда) 
	IКвартал = Ложь;
	IIКвартал = Ложь;
	IIIКвартал = Истина;
	IVКвартал = Ложь;
	УстановитьПериод(3, Неопределено, "Квартал"); 
	ОбновитьПодсветкуЭлементов()
КонецПроцедуры

&НаКлиенте
Процедура IVКвартал(Команда)
	IКвартал = Ложь;
	IIКвартал = Ложь;
	IIIКвартал = Ложь;
	IVКвартал = Истина;
	УстановитьПериод(4, Неопределено, "Квартал");
	ОбновитьПодсветкуЭлементов()
КонецПроцедуры

&НаКлиенте
Процедура IПолугодие(Команда)
	IПолугодие = Истина;
	IIПолугодие = Ложь;
	УстановитьПериод (Неопределено, 1, "Полугодие");
	ОбновитьПодсветкуЭлементов()
КонецПроцедуры

&НаКлиенте
Процедура IIПолугодие(Команда)
	IПолугодие = Ложь;
	IIПолугодие = Истина;
	УстановитьПериод (Неопределено, 2, "Полугодие");
	ОбновитьПодсветкуЭлементов()
КонецПроцедуры

&НаКлиенте
Процедура ГрафикДоходыГлав(Команда)
	ПризнакГрафикДоходыГлав = Истина;
	ПризнакГрафикСреднийЧекГлав = Ложь;
	ОбновитьПодсветкуЭлементов();
	ОбновитьВидимостьГрафиков()
КонецПроцедуры

&НаКлиенте
Процедура ГрафикСреднийЧекГлав(Команда)
	ПризнакГрафикДоходыГлав = Ложь;
	ПризнакГрафикСреднийЧекГлав = Истина;
	ОбновитьПодсветкуЭлементов();
	ОбновитьВидимостьГрафиков();
КонецПроцедуры



&НаКлиенте
Процедура ГрафикДоходов(Команда)
	ПризнакГрафикДоходов = Истина;
	ПризнакГрафикСрЧеки = Ложь;
	ПризнакАналитикаПоПациентам = Ложь;
	ОбновитьПодсветкуЭлементов();
	ОбновитьВидимостьГрафиков();
КонецПроцедуры

&НаКлиенте
Процедура ГрафикСредниеЧеки(Команда)
	ПризнакГрафикДоходов = Ложь;
	ПризнакГрафикСрЧеки = Истина;
	ПризнакАналитикаПоПациентам = Ложь;
	ОбновитьПодсветкуЭлементов();
	ОбновитьВидимостьГрафиков();
КонецПроцедуры


&НаКлиенте
Процедура ГрафикАналитикаПациентов(Команда)
	ПризнакГрафикДоходов = Ложь;
	ПризнакГрафикСрЧеки = Ложь;
	ПризнакАналитикаПоПациентам = Истина;
	ОбновитьПодсветкуЭлементов();
	ОбновитьВидимостьГрафиков();
	
КонецПроцедуры

&НаКлиенте
Процедура ФилиалДляАналитикиПоПациентамПриИзменении(Элемент)
	ЗаполнитьГрафикПосещенийИПациентовИПостоянных();
	ЗаполнитьГрафикПроцентовПовторныхПосещенийИПроцентовПостоянныхПациентов();
КонецПроцедуры 
&НаКлиенте
Процедура МедицинскийЦентрДляАналитикиПоПациентамПриИзменении(Элемент)
	ЗаполнитьГрафикПосещенийИПациентовИПостоянных();
	ЗаполнитьГрафикПроцентовПовторныхПосещенийИПроцентовПостоянныхПациентов();
КонецПроцедуры


&НаКлиенте
Процедура ПостроитьАналитическуюПанель(Команда)
	РассчитатьДанныеИЗаполнитьПанель();
	//ОбновитьВидимостьГрафиков();
	ОбновитьВидимостьГруппПриИзмененииНастроек();
	ОбновитьВидимостьГрафиков();
	ОбновитьПодсветкуЭлементов();

	
КонецПроцедуры  

&НаКлиенте
Процедура РассчитатьДанныеИЗаполнитьПанель()
	РассчитатьДанныеНаСервере();
	ЗаполнитьДиаграммуДоляУслугВВыручке();
	ЗаполнитьГрафикПоДоходам();
	ЗаполнитьГрафикПосещенийИПациентовИПостоянных(); 
	ЗаполнитьГрафикПроцентовПовторныхПосещенийИПроцентовПостоянныхПациентов();
	ЗаполнитьГистограммуПервичныхПовторныхПациентов();
	ЗаполнитьГрафикПервичныхПовторныхПациентов();
	ЗаполнитьСтатистику();
КонецПроцедуры

&НаСервере
Процедура РассчитатьДанныеНаСервере()
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПоказателиДляМонитораРуководителя.Показатель КАК Показатель,
	|	ПоказателиДляМонитораРуководителя.Разрез КАК Разрез,
	|	ПоказателиДляМонитораРуководителя.ТипУслуги КАК ТипУслуги,
	|	ПоказателиДляМонитораРуководителя.ТипОплаты КАК ТипОплаты,
	|	СУММА(ПоказателиДляМонитораРуководителя.Значение) КАК Значение,
	|	НАЧАЛОПЕРИОДА(ПоказателиДляМонитораРуководителя.Период, МЕСЯЦ) КАК Месяц
	|ИЗ
	|	РегистрСведений.омг_ПоказателиДляМонитораРуководителя КАК ПоказателиДляМонитораРуководителя
	|ГДЕ
	|	ПоказателиДляМонитораРуководителя.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ПоказателиДляМонитораРуководителя.Организация = &Организация
	|	И ПоказателиДляМонитораРуководителя.МедицинскийЦентр = &МедицинскийЦентр
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ПоказателиДляМонитораРуководителя.Период, МЕСЯЦ),
	|	ПоказателиДляМонитораРуководителя.Показатель,
	|	ПоказателиДляМонитораРуководителя.Разрез,
	|	ПоказателиДляМонитораРуководителя.ТипУслуги,
	|	ПоказателиДляМонитораРуководителя.ТипОплаты,
	|	ПоказателиДляМонитораРуководителя.Организация,
	|	ПоказателиДляМонитораРуководителя.МедицинскийЦентр";
	
	
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("Организация", Филиал);
	Запрос.УстановитьПараметр("МедицинскийЦентр", МедицинскийЦентр);
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ПоказательСреднийЧек = Справочники.ПоказателиПланирования.СреднийЧек;
	ПоказательДоход = Справочники.ПоказателиПланирования.Доход;
	ПоказательКоличествоВизитов = Справочники.ПоказателиПланирования.КоличествоВизитов;
	ПоказательКоличествоУникальныхПациентов = Справочники.ПоказателиПланирования.КоличествоУникальныхПациентов;	
	ПоказательКоличествоПостоянныхПациентов = Справочники.ПоказателиПланирования.КоличествоПостоянныхПациентов;
	ПоказательПроцентПовторныхПосещений = Справочники.ПоказателиПланирования.ПроцентПовторныхПосещений;
	ПоказательПроцентПостоянныхКлиентов = Справочники.ПоказателиПланирования.ПроцентПостоянныхКлиентов;
	
	Если ВыборМесяц Тогда
		Пока Выборка.Следующий() Цикл
			Если Выборка.Показатель = ПоказательСреднийЧек И Выборка.ТипУслуги = "" И Выборка.ТипОплаты = "" Тогда
				СреднийЧекОбщий = Выборка.Значение;
			ИначеЕсли
				Выборка.Показатель = ПоказательСреднийЧек И Выборка.ТипУслуги = "Лабораторные услуги" И Выборка.ТипОплаты = "" Тогда
				СреднийЧекЛабораторные = Выборка.Значение;
			ИначеЕсли
				Выборка.Показатель = ПоказательСреднийЧек И Выборка.ТипУслуги = "Медицинские услуги" И Выборка.ТипОплаты = "" Тогда
				СреднийЧекМедицинские = Выборка.Значение;
			ИначеЕсли
				Выборка.Показатель = ПоказательСреднийЧек И Выборка.ТипУслуги = "Лабораторные услуги" И Выборка.ТипОплаты = "ГОБМП" Тогда
				СреднийЧекЛабораторныеГОБМП = Выборка.Значение;	
			ИначеЕсли
				Выборка.Показатель = ПоказательСреднийЧек И Выборка.ТипУслуги = "Лабораторные услуги" И Выборка.ТипОплаты = "Платные" Тогда
				СреднийЧекЛабораторныеПлатные = Выборка.Значение;	
			ИначеЕсли
				Выборка.Показатель = ПоказательСреднийЧек И Выборка.ТипУслуги = "Медицинские услуги" И Выборка.ТипОплаты = "ГОБМП" Тогда
				СреднийЧекМедицинскиеГОБМП = Выборка.Значение;	
			ИначеЕсли
				Выборка.Показатель = ПоказательСреднийЧек И Выборка.ТипУслуги = "Медицинские услуги" И Выборка.ТипОплаты = "Платные" Тогда
				СреднийЧекМедицинскиеПлатные = Выборка.Значение;	
			ИначеЕсли 
				Выборка.Показатель = ПоказательДоход И Выборка.ТипУслуги = "" И Выборка.ТипОплаты = "" Тогда
				ДоходыОбщие = Выборка.Значение;	
			ИначеЕсли 
				Выборка.Показатель = ПоказательДоход И Выборка.ТипУслуги = "Лабораторные услуги" И Выборка.ТипОплаты = "" Тогда
				ДоходыЛабораторные = Выборка.Значение;	
			ИначеЕсли 
				Выборка.Показатель = ПоказательДоход И Выборка.ТипУслуги = "Медицинские услуги" И Выборка.ТипОплаты = "" Тогда
				ДоходыМедицинские = Выборка.Значение;	
			ИначеЕсли 
				Выборка.Показатель = ПоказательДоход И Выборка.ТипУслуги = "Лабораторные услуги" И Выборка.ТипОплаты = "ГОБМП" Тогда
				ДоходыЛабораторныеГОБМП = Выборка.Значение;		
			ИначеЕсли 
				Выборка.Показатель = ПоказательДоход И Выборка.ТипУслуги = "Лабораторные услуги" И Выборка.ТипОплаты = "Платные" Тогда
				ДоходыЛабораторныеПлатные = Выборка.Значение;	
			ИначеЕсли
				Выборка.Показатель = ПоказательДоход И Выборка.ТипУслуги = "Медицинские услуги" И Выборка.ТипОплаты = "ГОБМП" Тогда
				ДоходыМедицинскиеГОБМП = Выборка.Значение;	
			ИначеЕсли
				Выборка.Показатель = ПоказательДоход И Выборка.ТипУслуги = "Медицинские услуги" И Выборка.ТипОплаты = "Платные" Тогда
				ДоходыМедицинскиеПлатные = Выборка.Значение;	
			ИначеЕсли 
				Выборка.Показатель = ПоказательКоличествоВизитов Тогда
				КоличествоВизитов = Выборка.Значение;
			ИначеЕсли 
				Выборка.Показатель = ПоказательКоличествоУникальныхПациентов Тогда
				КоличествоПациентов = Выборка.Значение;	
			ИначеЕсли 
				Выборка.Показатель = ПоказательКоличествоПостоянныхПациентов Тогда
				КоличествоПостоянныхПациентов = Выборка.Значение;
			ИначеЕсли 
				Выборка.Показатель = ПоказательПроцентПовторныхПосещений Тогда
				ПроцентПовторныхПосещений = Выборка.Значение;
			ИначеЕсли 
				Выборка.Показатель = ПоказательПроцентПостоянныхКлиентов Тогда
				ПроцентПостоянныхКлиентов = Выборка.Значение;
			КонецЕсли;	
		КонецЦикла;
	Иначе          
		////////////////////////
		ГрафикДоходыГлав.Обновление = Ложь;
		ГрафикДоходыГлав.Очистить();
		ГрафикДоходыГлав.АвтоТранспонирование = Ложь;
		////////////////////////
		ГрафикСреднийЧекГлав.Обновление = Ложь;
		ГрафикСреднийЧекГлав.Очистить();
		ГрафикСреднийЧекГлав.АвтоТранспонирование = Ложь;
		////////////////////////
		ДоляУслугВВыручкеДлительныйПериод.Обновление = Ложь;
		ДоляУслугВВыручкеДлительныйПериод.Очистить();
		ДоляУслугВВыручкеДлительныйПериод.АвтоТранспонирование = Ложь;
		
		
		
		Пока Выборка.Следующий() Цикл
			Если Выборка.Показатель = ПоказательСреднийЧек И Выборка.ТипУслуги = "" И Выборка.ТипОплаты = "" Тогда
				
				Точка = ГрафикСреднийЧекГлав.УстановитьТочку(Выборка.Месяц);
				Точка.Текст = Формат(Выборка.Месяц,"ДФ=ММММ");
				СерияСреднийЧекОбщий = ГрафикСреднийЧекГлав.УстановитьСерию("Средний чек");
				//СерияСреднийЧекОбщий.Текст = "Средний чек";
				ГрафикСреднийЧекГлав.УстановитьЗначение(Точка, СерияСреднийЧекОбщий, Выборка.Значение);
				
			ИначеЕсли
				Выборка.Показатель = ПоказательСреднийЧек И Выборка.ТипУслуги = "Лабораторные услуги" И Выборка.ТипОплаты = "" Тогда
				//СреднийЧекЛабораторные = Выборка.Значение;
				Точка = ГрафикСреднийЧекГлав.УстановитьТочку(Выборка.Месяц);
				Точка.Текст = Формат(Выборка.Месяц,"ДФ=ММММ");
				СерияСреднийЧекЛабораторные = ГрафикСреднийЧекГлав.УстановитьСерию("Средний чек (Лабораторные услуги)");
				СерияСреднийЧекЛабораторные.Текст = "Средний чек (Лабораторные услуги)";
				ГрафикСреднийЧекГлав.УстановитьЗначение(Точка, СерияСреднийЧекЛабораторные, Выборка.Значение);
				
			ИначеЕсли
				Выборка.Показатель = ПоказательСреднийЧек И Выборка.ТипУслуги = "Медицинские услуги" И Выборка.ТипОплаты = "" Тогда
				//СреднийЧекМедицинские = Выборка.Значение;
				Точка = ГрафикСреднийЧекГлав.УстановитьТочку(Выборка.Месяц);
				Точка.Текст = Формат(Выборка.Месяц,"ДФ=ММММ");
				СерияСреднийЧекМедицинские = ГрафикСреднийЧекГлав.УстановитьСерию("Средний чек (Медицинские услуги)");
				СерияСреднийЧекМедицинские.Текст = "Средний чек (Медицинские услуги)";
				ГрафикСреднийЧекГлав.УстановитьЗначение(Точка, СерияСреднийЧекМедицинские, Выборка.Значение);
				
			ИначеЕсли
				Выборка.Показатель = ПоказательСреднийЧек И Выборка.ТипУслуги = "Лабораторные услуги" И Выборка.ТипОплаты = "ГОБМП" Тогда
				//СреднийЧекЛабораторныеГОБМП = Выборка.Значение;
				Точка = ГрафикСреднийЧекГлав.УстановитьТочку(Выборка.Месяц);
				Точка.Текст = Формат(Выборка.Месяц,"ДФ=ММММ");
				СерияСреднийЧекЛабораторныеГОБМП = ГрафикСреднийЧекГлав.УстановитьСерию("Средний чек (Лабораторные услуги ГОБМП)");
				СерияСреднийЧекЛабораторныеГОБМП.Текст = "Средний чек (Лабораторные услуги ГОБМП)";
				ГрафикСреднийЧекГлав.УстановитьЗначение(Точка, СерияСреднийЧекЛабораторныеГОБМП, Выборка.Значение);
				
			ИначеЕсли
				Выборка.Показатель = ПоказательСреднийЧек И Выборка.ТипУслуги = "Лабораторные услуги" И Выборка.ТипОплаты = "Платные" Тогда
				//СреднийЧекЛабораторныеПлатные = Выборка.Значение;
				Точка = ГрафикСреднийЧекГлав.УстановитьТочку(Выборка.Месяц);
				Точка.Текст = Формат(Выборка.Месяц,"ДФ=ММММ");
				СерияСреднийЧекЛабораторныеПлатные = ГрафикСреднийЧекГлав.УстановитьСерию("Средний чек (Лабораторные услуги ПЛАТНЫЕ)");
				СерияСреднийЧекЛабораторныеПлатные.Текст = "Средний чек (Лабораторные услуги ПЛАТНЫЕ)";
				ГрафикСреднийЧекГлав.УстановитьЗначение(Точка, СерияСреднийЧекЛабораторныеПлатные, Выборка.Значение);
				
			ИначеЕсли
				Выборка.Показатель = ПоказательСреднийЧек И Выборка.ТипУслуги = "Медицинские услуги" И Выборка.ТипОплаты = "ГОБМП" Тогда
				//СреднийЧекМедицинскиеГОБМП = Выборка.Значение;
				Точка = ГрафикСреднийЧекГлав.УстановитьТочку(Выборка.Месяц);
				Точка.Текст = Формат(Выборка.Месяц,"ДФ=ММММ");
				СерияСреднийЧекМедицинскиеГОБМП = ГрафикСреднийЧекГлав.УстановитьСерию("Средний чек (Медицинские услуги ГОБМП)");
				СерияСреднийЧекМедицинскиеГОБМП.Текст = "Средний чек (Медицинские услуги ГОБМП)";
				ГрафикСреднийЧекГлав.УстановитьЗначение(Точка, СерияСреднийЧекМедицинскиеГОБМП, Выборка.Значение);
				
			ИначеЕсли
				Выборка.Показатель = ПоказательСреднийЧек И Выборка.ТипУслуги = "Медицинские услуги" И Выборка.ТипОплаты = "Платные" Тогда
				//СреднийЧекМедицинскиеПлатные = Выборка.Значение;
				Точка = ГрафикСреднийЧекГлав.УстановитьТочку(Выборка.Месяц);
				Точка.Текст = Формат(Выборка.Месяц,"ДФ=ММММ");
				СерияСреднийЧекМедицинскиеПлатные = ГрафикСреднийЧекГлав.УстановитьСерию("Средний чек (Медицинские услуги ПЛАТНЫЕ)");
				СерияСреднийЧекМедицинскиеПлатные.Текст = "Средний чек (Медицинские услуги ПЛАТНЫЕ)";
				ГрафикСреднийЧекГлав.УстановитьЗначение(Точка, СерияСреднийЧекМедицинскиеПлатные, Выборка.Значение);
				
			ИначеЕсли 
				Выборка.Показатель = ПоказательДоход И Выборка.ТипУслуги = "" И Выборка.ТипОплаты = "" Тогда
				//ДоходыОбщие = Выборка.Значение;
				Точка = ГрафикДоходыГлав.УстановитьТочку(Выборка.Месяц);
				Точка.Текст = Формат(Выборка.Месяц,"ДФ=ММММ");
				СерияДоходыОбщие = ГрафикДоходыГлав.УстановитьСерию("Доходы");
				СерияДоходыОбщие.Текст = "Доходы";
				ГрафикДоходыГлав.УстановитьЗначение(Точка, СерияДоходыОбщие, Выборка.Значение);
				
			ИначеЕсли 
				Выборка.Показатель = ПоказательДоход И Выборка.ТипУслуги = "Лабораторные услуги" И Выборка.ТипОплаты = "" Тогда
				//ДоходыЛабораторные = Выборка.Значение;
				Точка = ГрафикДоходыГлав.УстановитьТочку(Выборка.Месяц);
				Точка.Текст = Формат(Выборка.Месяц,"ДФ=ММММ");
				СерияДоходыЛабораторные = ГрафикДоходыГлав.УстановитьСерию("Доходы (Лабораторные услуги)");
				СерияДоходыЛабораторные.Текст = "Доходы (Лабораторные услуги)";
				ГрафикДоходыГлав.УстановитьЗначение(Точка, СерияДоходыЛабораторные, Выборка.Значение);
				/////////////////////////////////
				ТочкаГрафикДоли = ДоляУслугВВыручкеДлительныйПериод.УстановитьТочку(Выборка.Месяц);
				ТочкаГрафикДоли.Текст = Формат(Выборка.Месяц,"ДФ=ММММ");
				СерияДоходыЛабораторныеГрафикДоли = ДоляУслугВВыручкеДлительныйПериод.УстановитьСерию("Лабораторные услуги");
				ДоляУслугВВыручкеДлительныйПериод.УстановитьЗначение(ТочкаГрафикДоли, СерияДоходыЛабораторныеГрафикДоли, Выборка.Значение);
				
				
			ИначеЕсли 
				Выборка.Показатель = ПоказательДоход И Выборка.ТипУслуги = "Медицинские услуги" И Выборка.ТипОплаты = "" Тогда
				//ДоходыМедицинские = Выборка.Значение;
				Точка = ГрафикДоходыГлав.УстановитьТочку(Выборка.Месяц);
				Точка.Текст = Формат(Выборка.Месяц,"ДФ=ММММ");
				СерияДоходыМедицинские = ГрафикДоходыГлав.УстановитьСерию("Доходы (Медицинские услуги)");
				СерияДоходыМедицинские.Текст = "Доходы (Медицинские услуги)";
				ГрафикДоходыГлав.УстановитьЗначение(Точка, СерияДоходыМедицинские, Выборка.Значение);
				/////////////////////////////////
				ТочкаГрафикДоли = ДоляУслугВВыручкеДлительныйПериод.УстановитьТочку(Выборка.Месяц);
				ТочкаГрафикДоли.Текст = Формат(Выборка.Месяц,"ДФ=ММММ");
				СерияДоходыМедицинскиеГрафикДоли = ДоляУслугВВыручкеДлительныйПериод.УстановитьСерию("Медицинские услуги");
				ДоляУслугВВыручкеДлительныйПериод.УстановитьЗначение(ТочкаГрафикДоли, СерияДоходыМедицинскиеГрафикДоли, Выборка.Значение);
				
			ИначеЕсли 
				Выборка.Показатель = ПоказательДоход И Выборка.ТипУслуги = "Лабораторные услуги" И Выборка.ТипОплаты = "ГОБМП" Тогда
				//ДоходыЛабораторныеГОБМП = Выборка.Значение;
				Точка = ГрафикДоходыГлав.УстановитьТочку(Выборка.Месяц);
				Точка.Текст = Формат(Выборка.Месяц,"ДФ=ММММ");
				СерияДоходыЛабораторныеГОБМП = ГрафикДоходыГлав.УстановитьСерию("Доходы (Лабораторные услуги ГОБМП)");
				СерияДоходыЛабораторныеГОБМП.Текст = "Доходы (Лабораторные услуги ГОБМП)";
				ГрафикДоходыГлав.УстановитьЗначение(Точка, СерияДоходыЛабораторныеГОБМП, Выборка.Значение);
				
			ИначеЕсли 
				Выборка.Показатель = ПоказательДоход И Выборка.ТипУслуги = "Лабораторные услуги" И Выборка.ТипОплаты = "Платные" Тогда
				//ДоходыЛабораторныеПлатные = Выборка.Значение;
				Точка = ГрафикДоходыГлав.УстановитьТочку(Выборка.Месяц);
				Точка.Текст = Формат(Выборка.Месяц,"ДФ=ММММ");
				СерияДоходыЛабораторныеПлатные = ГрафикДоходыГлав.УстановитьСерию("Доходы (Лабораторные услуги ПЛАТНЫЕ)");
				СерияДоходыЛабораторныеПлатные.Текст = "Доходы (Лабораторные услуги ПЛАТНЫЕ)";
				ГрафикДоходыГлав.УстановитьЗначение(Точка, СерияДоходыЛабораторныеПлатные, Выборка.Значение);
				
			ИначеЕсли
				Выборка.Показатель = ПоказательДоход И Выборка.ТипУслуги = "Медицинские услуги" И Выборка.ТипОплаты = "ГОБМП" Тогда
				//ДоходыМедицинскиеГОБМП = Выборка.Значение;
				Точка = ГрафикДоходыГлав.УстановитьТочку(Выборка.Месяц);
				Точка.Текст = Формат(Выборка.Месяц,"ДФ=ММММ");
				СерияДоходыМедицинскиеГОБМП = ГрафикДоходыГлав.УстановитьСерию("Доходы (Медицинские услуги ГОБМП)");
				СерияДоходыМедицинскиеГОБМП.Текст = "Доходы (Медицинские услуги ГОБМП)";
				ГрафикДоходыГлав.УстановитьЗначение(Точка, СерияДоходыМедицинскиеГОБМП, Выборка.Значение);
				
			ИначеЕсли
				Выборка.Показатель = ПоказательДоход И Выборка.ТипУслуги = "Медицинские услуги" И Выборка.ТипОплаты = "Платные" Тогда
				//ДоходыМедицинскиеПлатные = Выборка.Значение;
				Точка = ГрафикДоходыГлав.УстановитьТочку(Выборка.Месяц);
				Точка.Текст = Формат(Выборка.Месяц,"ДФ=ММММ");
				СерияДоходыМедицинскиеПлатные = ГрафикДоходыГлав.УстановитьСерию("Доходы (Медицинские услуги ПЛАТНЫЕ)");
				СерияДоходыМедицинскиеПлатные.Текст = "Доходы (Медицинские услуги ПЛАТНЫЕ)";
				ГрафикДоходыГлав.УстановитьЗначение(Точка, СерияДоходыМедицинскиеПлатные, Выборка.Значение);
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДиаграммуДоляУслугВВыручке()
	
	ДоляУслугВВыручке.Обновление = Ложь;
	ДоляУслугВВыручке.Очистить();
	ДоляУслугВВыручке.АвтоТранспонирование = Ложь;
	ОбщееКоличество = ДоходыОбщие;
	Точка = ДоляУслугВВыручке.УстановитьТочку(ДоходыОбщие);
	СерияЛабораторные = ДоляУслугВВыручке.УстановитьСерию("Лабораторные услуги");
	СерияЛабораторные.Цвет = WebЦвета.Желтый;
	ДоляУслугВВыручке.УстановитьЗначение(Точка , СерияЛабораторные, ДоходыЛабораторные);
	СерияМедицинские = ДоляУслугВВыручке.УстановитьСерию("Медицинские услуги");
	ДоляУслугВВыручке.УстановитьЗначение(Точка , СерияМедицинские, ДоходыМедицинские);
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьПереченьПоказателейНаСервере()
	
	ПереченьПоказателей = Новый Структура;
	ПереченьПоказателей.Вставить("ПоказательСреднийЧек", Справочники.ПоказателиПланирования.СреднийЧек);
	ПереченьПоказателей.Вставить("ПоказательДоход", Справочники.ПоказателиПланирования.Доход);
	ПереченьПоказателей.Вставить("ПоказательКоличествоВизитов", Справочники.ПоказателиПланирования.КоличествоВизитов);
	ПереченьПоказателей.Вставить("ПоказательКоличествоУникальныхПациентов", Справочники.ПоказателиПланирования.КоличествоУникальныхПациентов);
	ПереченьПоказателей.Вставить("ПоказательКоличествоПостоянныхПациентов", Справочники.ПоказателиПланирования.КоличествоПостоянныхПациентов);
	ПереченьПоказателей.Вставить("ПоказательПроцентПовторныхПосещений", Справочники.ПоказателиПланирования.ПроцентПовторныхПосещений);
	ПереченьПоказателей.Вставить("ПоказательПроцентПостоянныхКлиентов", Справочники.ПоказателиПланирования.ПроцентПостоянныхКлиентов);
	ПереченьПоказателей.Вставить("ПоказательКоличествоПервичныхПриемов", Справочники.ПоказателиПланирования.КоличествоПервичныхПриемов);
	ПереченьПоказателей.Вставить("ПоказательКоличествоПовторныхПриемов", Справочники.ПоказателиПланирования.КоличествоПовторныхПриемов);
	ПереченьПоказателей.Вставить("ПоказательКоличествоНовыхКлиентов", Справочники.ПоказателиПланирования.КоличествоНовыхПациентов);
	Возврат ПереченьПоказателей
КонецФункции
&НаСервере
Процедура ЗаполнитьГрафикПоДоходам()
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПоказателиДляМонитораРуководителя.Показатель КАК Показатель,
	|	ПоказателиДляМонитораРуководителя.Разрез КАК Разрез,
	|	ПоказателиДляМонитораРуководителя.ТипУслуги КАК ТипУслуги,
	|	ПоказателиДляМонитораРуководителя.ТипОплаты КАК ТипОплаты,
	|	СУММА(ПоказателиДляМонитораРуководителя.Значение) КАК Значение,
	|	ПоказателиДляМонитораРуководителя.Организация КАК Организация,
	|	ПоказателиДляМонитораРуководителя.МедицинскийЦентр КАК МедицинскийЦентр,
	|	НАЧАЛОПЕРИОДА(ПоказателиДляМонитораРуководителя.Период, МЕСЯЦ) КАК Месяц
	|ИЗ
	|	РегистрСведений.омг_ПоказателиДляМонитораРуководителя КАК ПоказателиДляМонитораРуководителя
	|ГДЕ
	|	ПоказателиДляМонитораРуководителя.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ПоказателиДляМонитораРуководителя.ТипУслуги = &ТипУслуги
	|	И ПоказателиДляМонитораРуководителя.ТипОплаты = &ТипОплаты
	|	И ПоказателиДляМонитораРуководителя.Организация <> &Организация
	//|	И ПоказателиДляМонитораРуководителя.МедицинскийЦентр = &МедицинскийЦентр
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ПоказателиДляМонитораРуководителя.Период, МЕСЯЦ),
	|	ПоказателиДляМонитораРуководителя.Показатель,
	|	ПоказателиДляМонитораРуководителя.Разрез,
	|	ПоказателиДляМонитораРуководителя.ТипУслуги,
	|	ПоказателиДляМонитораРуководителя.ТипОплаты,
	|	ПоказателиДляМонитораРуководителя.Организация,
	|	ПоказателиДляМонитораРуководителя.МедицинскийЦентр";
	
	
	ПоказательСреднийЧек = Справочники.ПоказателиПланирования.СреднийЧек;
	ПоказательДоход = Справочники.ПоказателиПланирования.Доход;
	ПоказательКоличествоВизитов = Справочники.ПоказателиПланирования.КоличествоВизитов;
	ПоказательКоличествоУникальныхПациентов = Справочники.ПоказателиПланирования.КоличествоУникальныхПациентов;	
	ПоказательКоличествоПостоянныхПациентов = Справочники.ПоказателиПланирования.КоличествоПостоянныхПациентов;
	ПоказательПроцентПовторныхПосещений = Справочники.ПоказателиПланирования.ПроцентПовторныхПосещений;
	ПоказательПроцентПостоянныхКлиентов = Справочники.ПоказателиПланирования.ПроцентПостоянныхКлиентов;
	ПоказательПервичныхПриемов = Справочники.ПоказателиПланирования.КоличествоПервичныхПриемов;
	ПоказательПовторныхПриемов = Справочники.ПоказателиПланирования.КоличествоПовторныхПриемов;
	ПоказательНовыйКлиентов = Справочники.ПоказателиПланирования.КоличествоНовыхПациентов;

	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("ТипУслуги", "");
	Запрос.УстановитьПараметр("ТипОплаты", "");
	Запрос.УстановитьПараметр("Организация", "");
	//Запрос.УстановитьПараметр("МедицинскийЦентр", МедицинскийЦентр);
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать(); 
	
	
	
	ГрафикДоходов.Обновление = Ложь;
	ГрафикДоходов.Очистить();
	ГрафикДоходов.АвтоТранспонирование = Ложь;
	/////////////////////
	ГрафикСреднийЧек.Обновление = Ложь;
	ГрафикСреднийЧек.Очистить();
	ГрафикСреднийЧек.АвтоТранспонирование = Ложь;    
	
	ДанныеПоАналитикеПациентов.Очистить();
	Пока Выборка.Следующий() Цикл
		Если ПоВсейГруппеКомпаний Тогда
			Если Выборка.Показатель = ПоказательДоход И ЗначениеЗаполнено(Выборка.Организация) И НЕ ЗначениеЗаполнено(Выборка.МедицинскийЦентр) Тогда 
				Точка = ГрафикДоходов.УстановитьТочку(Выборка.Месяц);
				Точка.Текст = Формат(Выборка.Месяц,"ДФ=ММММ");
				Серия = ГрафикДоходов.УстановитьСерию(Выборка.Организация);
				ГрафикДоходов.УстановитьЗначение(Точка, Серия, Выборка.Значение);
			ИначеЕсли Выборка.Показатель = ПоказательСреднийЧек И ЗначениеЗаполнено(Выборка.Организация) И НЕ ЗначениеЗаполнено(Выборка.МедицинскийЦентр) Тогда 
				Точка = ГрафикСреднийЧек.УстановитьТочку(Выборка.Месяц);
				Точка.Текст = Формат(Выборка.Месяц,"ДФ=ММММ");
				Серия = ГрафикСреднийЧек.УстановитьСерию(Выборка.Организация);
				ГрафикСреднийЧек.УстановитьЗначение(Точка, Серия, Выборка.Значение);
			ИначеЕсли Выборка.Показатель = ПоказательКоличествоВизитов ИЛИ 
				Выборка.Показатель = ПоказательКоличествоУникальныхПациентов ИЛИ 
				Выборка.Показатель = ПоказательКоличествоПостоянныхПациентов ИЛИ 
				Выборка.Показатель = ПоказательПроцентПовторныхПосещений ИЛИ 
				Выборка.Показатель = ПоказательПроцентПостоянныхКлиентов ИЛИ
				Выборка.Показатель = ПоказательПервичныхПриемов ИЛИ
				Выборка.Показатель = ПоказательПовторныхПриемов ИЛИ
				Выборка.Показатель = ПоказательНовыйКлиентов Тогда
				НоваяСтрока = ДанныеПоАналитикеПациентов.Добавить();
				НоваяСтрока.Период = Выборка.Месяц;
				НоваяСтрока.Филиал = ВЫборка.Организация;
				НоваяСтрока.Показатель = Выборка.Показатель;
				НоваяСтрока.Значение = Выборка.Значение;
				НоваяСтрока.МедицинскийЦентр = Выборка.МедицинскийЦентр;
				
			КонецЕсли;
		ИначеЕсли ПоФилиалу Тогда
			Если Выборка.Организация = Филиал И Выборка.Показатель = ПоказательДоход И ЗначениеЗаполнено(Выборка.МедицинскийЦентр)  Тогда 
				Точка = ГрафикДоходов.УстановитьТочку(Выборка.Месяц);
				Точка.Текст = Формат(Выборка.Месяц,"ДФ=ММММ");
				Серия = ГрафикДоходов.УстановитьСерию(Выборка.МедицинскийЦентр);
				ГрафикДоходов.УстановитьЗначение(Точка, Серия, Выборка.Значение);
			ИначеЕсли Выборка.Организация = Филиал И Выборка.Показатель = ПоказательСреднийЧек И ЗначениеЗаполнено(Выборка.МедицинскийЦентр) Тогда 
				Точка = ГрафикСреднийЧек.УстановитьТочку(Выборка.Месяц);
				Точка.Текст = Формат(Выборка.Месяц,"ДФ=ММММ");
				Серия = ГрафикСреднийЧек.УстановитьСерию(Выборка.МедицинскийЦентр);
				ГрафикСреднийЧек.УстановитьЗначение(Точка, Серия, Выборка.Значение);
			ИначеЕсли Выборка.Показатель = ПоказательКоличествоВизитов ИЛИ 
				Выборка.Показатель = ПоказательКоличествоУникальныхПациентов ИЛИ 
				Выборка.Показатель = ПоказательКоличествоПостоянныхПациентов ИЛИ 
				Выборка.Показатель = ПоказательПроцентПовторныхПосещений ИЛИ 
				Выборка.Показатель = ПоказательПроцентПостоянныхКлиентов ИЛИ
				Выборка.Показатель = ПоказательПервичныхПриемов ИЛИ
				Выборка.Показатель = ПоказательПовторныхПриемов ИЛИ
				Выборка.Показатель = ПоказательНовыйКлиентов Тогда
				НоваяСтрока = ДанныеПоАналитикеПациентов.Добавить();
				НоваяСтрока.Период = Выборка.Месяц;
				НоваяСтрока.Филиал = ВЫборка.Организация;
				НоваяСтрока.Показатель = Выборка.Показатель;
				НоваяСтрока.Значение = Выборка.Значение;
				НоваяСтрока.МедицинскийЦентр = Выборка.МедицинскийЦентр;
			КонецЕсли;
		ИначеЕсли ПоМедицинскомуЦентру Тогда
			Если Выборка.Показатель = ПоказательКоличествоВизитов ИЛИ 
				Выборка.Показатель = ПоказательКоличествоУникальныхПациентов ИЛИ 
				Выборка.Показатель = ПоказательКоличествоПостоянныхПациентов ИЛИ 
				Выборка.Показатель = ПоказательПроцентПовторныхПосещений ИЛИ 
				Выборка.Показатель = ПоказательПроцентПостоянныхКлиентов ИЛИ
				Выборка.Показатель = ПоказательПервичныхПриемов ИЛИ
				Выборка.Показатель = ПоказательПовторныхПриемов ИЛИ
				Выборка.Показатель = ПоказательНовыйКлиентов Тогда
				НоваяСтрока = ДанныеПоАналитикеПациентов.Добавить();
				НоваяСтрока.Период = Выборка.Месяц;
				НоваяСтрока.Филиал = ВЫборка.Организация;
				НоваяСтрока.Показатель = Выборка.Показатель;
				НоваяСтрока.Значение = Выборка.Значение;
				НоваяСтрока.МедицинскийЦентр = Выборка.МедицинскийЦентр;
			КонецЕсли;
			
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьГрафикПосещенийИПациентовИПостоянных()
	ПереченьПоказателей = ПолучитьПереченьПоказателейНаСервере();
	
	/////////////////////
	ГрафикПосещенийИПациентовИПостоянных.Обновление = Ложь;
	ГрафикПосещенийИПациентовИПостоянных.Очистить();
	ГрафикПосещенийИПациентовИПостоянных.АвтоТранспонирование = Ложь;
	Если ПоВсейГруппеКомпаний Тогда
		Для Каждого Строка Из ДанныеПоАналитикеПациентов Цикл
			Если Строка.Филиал = ФилиалДляАналитикиПоПациентам И НЕ ЗначениеЗаполнено(Строка.МедицинскийЦентр) И 
				(Строка.Показатель = ПереченьПоказателей.ПоказательКоличествоВизитов ИЛИ 
				Строка.Показатель = ПереченьПоказателей.ПоказательКоличествоУникальныхПациентов ИЛИ
				Строка.Показатель = ПереченьПоказателей.ПоказательКоличествоПостоянныхПациентов) Тогда	
				Точка = ГрафикПосещенийИПациентовИПостоянных.УстановитьТочку(Строка.Период);
				Точка.Текст = Формат(Строка.Период,"ДФ=ММММ");
				Серия = ГрафикПосещенийИПациентовИПостоянных.УстановитьСерию(Строка.Показатель);
				ГрафикПосещенийИПациентовИПостоянных.УстановитьЗначение(Точка, Серия, Строка.Значение);
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ПоФилиалу Тогда
		Для Каждого Строка Из ДанныеПоАналитикеПациентов Цикл
			Если (Строка.Филиал = ФилиалДляАналитикиПоПациентам И Строка.МедицинскийЦентр = МедицинскийЦентрДляАналитикиПоПациентам) И 
				(Строка.Показатель = ПереченьПоказателей.ПоказательКоличествоВизитов ИЛИ 
				Строка.Показатель = ПереченьПоказателей.ПоказательКоличествоУникальныхПациентов ИЛИ
				Строка.Показатель = ПереченьПоказателей.ПоказательКоличествоПостоянныхПациентов) Тогда	
				Точка = ГрафикПосещенийИПациентовИПостоянных.УстановитьТочку(Строка.Период);
				Точка.Текст = Формат(Строка.Период,"ДФ=ММММ");
				Серия = ГрафикПосещенийИПациентовИПостоянных.УстановитьСерию(Строка.Показатель);
				ГрафикПосещенийИПациентовИПостоянных.УстановитьЗначение(Точка, Серия, Строка.Значение);
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ПоМедицинскомуЦентру Тогда
		Для Каждого Строка Из ДанныеПоАналитикеПациентов Цикл
			Если Строка.МедицинскийЦентр = МедицинскийЦентрДляАналитикиПоПациентам И 
				(Строка.Показатель = ПереченьПоказателей.ПоказательКоличествоВизитов ИЛИ 
				Строка.Показатель = ПереченьПоказателей.ПоказательКоличествоУникальныхПациентов ИЛИ
				Строка.Показатель = ПереченьПоказателей.ПоказательКоличествоПостоянныхПациентов) Тогда	
				Точка = ГрафикПосещенийИПациентовИПостоянных.УстановитьТочку(Строка.Период);
				Точка.Текст = Формат(Строка.Период,"ДФ=ММММ");
				Серия = ГрафикПосещенийИПациентовИПостоянных.УстановитьСерию(Строка.Показатель);
				ГрафикПосещенийИПациентовИПостоянных.УстановитьЗначение(Точка, Серия, Строка.Значение);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьГрафикПроцентовПовторныхПосещенийИПроцентовПостоянныхПациентов()
	//ПоказательСреднийЧек = Справочники.ПоказателиПланирования.СреднийЧек;
	//ПоказательДоход = Справочники.ПоказателиПланирования.Доход;
	//ПоказательКоличествоВизитов = Справочники.ПоказателиПланирования.КоличествоВизитов;
	//ПоказательКоличествоУникальныхПациентов = Справочники.ПоказателиПланирования.КоличествоУникальныхПациентов;	
	//ПоказательКоличествоПостоянныхПациентов = Справочники.ПоказателиПланирования.КоличествоПостоянныхПациентов;
	//ПоказательПроцентПовторныхПосещений = Справочники.ПоказателиПланирования.ПроцентПовторныхПосещений;
	//ПоказательПроцентПостоянныхКлиентов = Справочники.ПоказателиПланирования.ПроцентПостонныхКлиентов;
	ПереченьПоказателей = ПолучитьПереченьПоказателейНаСервере();
	/////////////////////
	ГрафикПроцентовПовторныхПациентовИПостоянных.Обновление = Ложь;
	ГрафикПроцентовПовторныхПациентовИПостоянных.Очистить();
	ГрафикПроцентовПовторныхПациентовИПостоянных.АвтоТранспонирование = Ложь;
	Если ПоВсейГруппеКомпаний Тогда
		Для Каждого Строка Из ДанныеПоАналитикеПациентов Цикл
			Если Строка.Филиал = ФилиалДляАналитикиПоПациентам И НЕ ЗначениеЗаполнено(Строка.МедицинскийЦентр) И (Строка.Показатель = ПереченьПоказателей.ПоказательПроцентПовторныхПосещений ИЛИ 
				Строка.Показатель = ПереченьПоказателей.ПоказательПроцентПостоянныхКлиентов) Тогда	
				Точка = ГрафикПроцентовПовторныхПациентовИПостоянных.УстановитьТочку(Строка.Период);
				Точка.Текст = Формат(Строка.Период,"ДФ=ММММ");
				Серия = ГрафикПроцентовПовторныхПациентовИПостоянных.УстановитьСерию(Строка.Показатель);
				ГрафикПроцентовПовторныхПациентовИПостоянных.УстановитьЗначение(Точка, Серия, Строка.Значение);
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ПоФилиалу Тогда
		Для Каждого Строка Из ДанныеПоАналитикеПациентов Цикл
			Если (Строка.Филиал = ФилиалДляАналитикиПоПациентам И Строка.МедицинскийЦентр = МедицинскийЦентрДляАналитикиПоПациентам) И 
				(Строка.Показатель = ПереченьПоказателей.ПоказательПроцентПовторныхПосещений ИЛИ 
				Строка.Показатель = ПереченьПоказателей.ПоказательПроцентПостоянныхКлиентов) Тогда	
				Точка = ГрафикПроцентовПовторныхПациентовИПостоянных.УстановитьТочку(Строка.Период);
				Точка.Текст = Формат(Строка.Период,"ДФ=ММММ");
				Серия = ГрафикПроцентовПовторныхПациентовИПостоянных.УстановитьСерию(Строка.Показатель);
				ГрафикПроцентовПовторныхПациентовИПостоянных.УстановитьЗначение(Точка, Серия, Строка.Значение);
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ПоМедицинскомуЦентру Тогда
		Для Каждого Строка Из ДанныеПоАналитикеПациентов Цикл
			Если Строка.МедицинскийЦентр = МедицинскийЦентрДляАналитикиПоПациентам И 
				(Строка.Показатель = ПереченьПоказателей.ПоказательПроцентПовторныхПосещений ИЛИ 
				Строка.Показатель = ПереченьПоказателей.ПоказательПроцентПостоянныхКлиентов) Тогда	
				Точка = ГрафикПроцентовПовторныхПациентовИПостоянных.УстановитьТочку(Строка.Период);
				Точка.Текст = Формат(Строка.Период,"ДФ=ММММ");
				Серия = ГрафикПроцентовПовторныхПациентовИПостоянных.УстановитьСерию(Строка.Показатель);
				ГрафикПроцентовПовторныхПациентовИПостоянных.УстановитьЗначение(Точка, Серия, Строка.Значение);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьГистограммуПервичныхПовторныхПациентов()
	ПереченьПоказателей = ПолучитьПереченьПоказателейНаСервере();
	

	
	/////////////////////
	ГрафикПервичныхПовторныхПациентов.Обновление = Ложь;
	ГрафикПервичныхПовторныхПациентов.Очистить();
	ГрафикПервичныхПовторныхПациентов.АвтоТранспонирование = Ложь;
	Если ПоВсейГруппеКомпаний Тогда
		Для Каждого Строка Из ДанныеПоАналитикеПациентов Цикл
			Если Строка.Филиал = Филиал И НЕ ЗначениеЗаполнено(Строка.МедицинскийЦентр) И 
				(Строка.Показатель = ПереченьПоказателей.ПоказательКоличествоВизитов ИЛИ 
				Строка.Показатель = ПереченьПоказателей.ПоказательКоличествоПервичныхПриемов ИЛИ
				Строка.Показатель = ПереченьПоказателей.ПоказательКоличествоПовторныхПриемов ИЛИ
				Строка.Показатель = ПереченьПоказателей.ПоказательКоличествоПостоянныхПациентов ИЛИ
				Строка.Показатель = ПереченьПоказателей.ПоказательКоличествоНовыхКлиентов) Тогда	
				Точка = ГрафикПервичныхПовторныхПациентов.УстановитьТочку(Строка.Период);
				Точка.Текст = Формат(Строка.Период,"ДФ=ММММ");
				Серия = ГрафикПервичныхПовторныхПациентов.УстановитьСерию(Строка.Показатель);
				ГрафикПервичныхПовторныхПациентов.УстановитьЗначение(Точка, Серия, Строка.Значение);
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ПоФилиалу Тогда
		Для Каждого Строка Из ДанныеПоАналитикеПациентов Цикл
			Если (Строка.Филиал = Филиал И Строка.МедицинскийЦентр = МедицинскийЦентр) И 
				(Строка.Показатель = ПереченьПоказателей.ПоказательКоличествоВизитов ИЛИ 
				Строка.Показатель = ПереченьПоказателей.ПоказательКоличествоПервичныхПриемов ИЛИ
				Строка.Показатель = ПереченьПоказателей.ПоказательКоличествоПовторныхПриемов ИЛИ
				Строка.Показатель = ПереченьПоказателей.ПоказательКоличествоПостоянныхПациентов ИЛИ
				Строка.Показатель = ПереченьПоказателей.ПоказательКоличествоНовыхКлиентов) Тогда	
				Точка = ГрафикПервичныхПовторныхПациентов.УстановитьТочку(Строка.Период);
				Точка.Текст = Формат(Строка.Период,"ДФ=ММММ");
				Серия = ГрафикПервичныхПовторныхПациентов.УстановитьСерию(Строка.Показатель);
				ГрафикПервичныхПовторныхПациентов.УстановитьЗначение(Точка, Серия, Строка.Значение);
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ПоМедицинскомуЦентру Тогда
		Для Каждого Строка Из ДанныеПоАналитикеПациентов Цикл
			Если Строка.МедицинскийЦентр = МедицинскийЦентр И 
				(Строка.Показатель = ПереченьПоказателей.ПоказательКоличествоВизитов ИЛИ 
				Строка.Показатель = ПереченьПоказателей.ПоказательКоличествоПервичныхПриемов ИЛИ
				Строка.Показатель = ПереченьПоказателей.ПоказательКоличествоПовторныхПриемов ИЛИ
				Строка.Показатель = ПереченьПоказателей.ПоказательКоличествоПостоянныхПациентов ИЛИ
				Строка.Показатель = ПереченьПоказателей.ПоказательКоличествоНовыхКлиентов) Тогда	
				Точка = ГрафикПервичныхПовторныхПациентов.УстановитьТочку(Строка.Период);
				Точка.Текст = Формат(Строка.Период,"ДФ=ММММ");
				Серия = ГрафикПервичныхПовторныхПациентов.УстановитьСерию(Строка.Показатель);
				ГрафикПервичныхПовторныхПациентов.УстановитьЗначение(Точка, Серия, Строка.Значение);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьГрафикПервичныхПовторныхПациентов()
	ПереченьПоказателей = ПолучитьПереченьПоказателейНаСервере();
	

	
	/////////////////////
	ГрафикПервичныхПовторныхПриемовВПериоде.Обновление = Ложь;
	ГрафикПервичныхПовторныхПриемовВПериоде.Очистить();
	ГрафикПервичныхПовторныхПриемовВПериоде.АвтоТранспонирование = Ложь;
	Если ПоВсейГруппеКомпаний Тогда
		Для Каждого Строка Из ДанныеПоАналитикеПациентов Цикл
			Если Строка.Филиал = Филиал И НЕ ЗначениеЗаполнено(Строка.МедицинскийЦентр) И 
				(Строка.Показатель = ПереченьПоказателей.ПоказательКоличествоВизитов ИЛИ 
				Строка.Показатель = ПереченьПоказателей.ПоказательКоличествоПервичныхПриемов ИЛИ
				Строка.Показатель = ПереченьПоказателей.ПоказательКоличествоПовторныхПриемов ИЛИ
				Строка.Показатель = ПереченьПоказателей.ПоказательКоличествоПостоянныхПациентов ИЛИ
				Строка.Показатель = ПереченьПоказателей.ПоказательКоличествоНовыхКлиентов) Тогда	
				Точка = ГрафикПервичныхПовторныхПриемовВПериоде.УстановитьТочку(Строка.Период);
				Точка.Текст = Формат(Строка.Период,"ДФ=ММММ");
				Серия = ГрафикПервичныхПовторныхПриемовВПериоде.УстановитьСерию(Строка.Показатель);
				ГрафикПервичныхПовторныхПриемовВПериоде.УстановитьЗначение(Точка, Серия, Строка.Значение);
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ПоФилиалу Тогда
		Для Каждого Строка Из ДанныеПоАналитикеПациентов Цикл
			Если (Строка.Филиал = Филиал И Строка.МедицинскийЦентр = МедицинскийЦентр) И 
				(Строка.Показатель = ПереченьПоказателей.ПоказательКоличествоВизитов ИЛИ 
				Строка.Показатель = ПереченьПоказателей.ПоказательКоличествоПервичныхПриемов ИЛИ
				Строка.Показатель = ПереченьПоказателей.ПоказательКоличествоПовторныхПриемов ИЛИ
				Строка.Показатель = ПереченьПоказателей.ПоказательКоличествоПостоянныхПациентов ИЛИ
				Строка.Показатель = ПереченьПоказателей.ПоказательКоличествоНовыхКлиентов) Тогда	
				Точка = ГрафикПервичныхПовторныхПриемовВПериоде.УстановитьТочку(Строка.Период);
				Точка.Текст = Формат(Строка.Период,"ДФ=ММММ");
				Серия = ГрафикПервичныхПовторныхПриемовВПериоде.УстановитьСерию(Строка.Показатель);
				ГрафикПервичныхПовторныхПриемовВПериоде.УстановитьЗначение(Точка, Серия, Строка.Значение);
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ПоМедицинскомуЦентру Тогда
		Для Каждого Строка Из ДанныеПоАналитикеПациентов Цикл
			Если Строка.МедицинскийЦентр = МедицинскийЦентр И 
				(Строка.Показатель = ПереченьПоказателей.ПоказательКоличествоВизитов ИЛИ 
				Строка.Показатель = ПереченьПоказателей.ПоказательКоличествоПервичныхПриемов ИЛИ
				Строка.Показатель = ПереченьПоказателей.ПоказательКоличествоПовторныхПриемов ИЛИ
				Строка.Показатель = ПереченьПоказателей.ПоказательКоличествоПостоянныхПациентов ИЛИ
				Строка.Показатель = ПереченьПоказателей.ПоказательКоличествоНовыхКлиентов) Тогда	
				Точка = ГрафикПервичныхПовторныхПриемовВПериоде.УстановитьТочку(Строка.Период);
				Точка.Текст = Формат(Строка.Период,"ДФ=ММММ");
				Серия = ГрафикПервичныхПовторныхПриемовВПериоде.УстановитьСерию(Строка.Показатель);
				ГрафикПервичныхПовторныхПриемовВПериоде.УстановитьЗначение(Точка, Серия, Строка.Значение);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ГодРегулирование(Элемент, Направление, СтандартнаяОбработка)
		СтандартнаяОбработка = Ложь;
	Попытка
		НачалоГода = НачалоГода(ДобавитьМесяц(НачалоГода, Направление * 12));
	Исключение
	КонецПопытки;
	Модифицированность = Истина;
    КонецГода = КонецГода(НачалоГода);
КонецПроцедуры 


&НаСервере
Процедура ЗаполнитьСтатистику()
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПоказателиДляМонитораРуководителя.Показатель КАК Показатель,
	|	ПоказателиДляМонитораРуководителя.Разрез КАК Разрез,
	|	ПоказателиДляМонитораРуководителя.ТипУслуги КАК ТипУслуги,
	|	ПоказателиДляМонитораРуководителя.ТипОплаты КАК ТипОплаты,
	|	СУММА(ПоказателиДляМонитораРуководителя.Значение) КАК Значение,
	|	НАЧАЛОПЕРИОДА(ПоказателиДляМонитораРуководителя.Период, МЕСЯЦ) КАК Месяц,
	|	ПоказателиДляМонитораРуководителя.Организация КАК Организация
	|ИЗ
	|	РегистрСведений.омг_ПоказателиДляМонитораРуководителя КАК ПоказателиДляМонитораРуководителя
	|ГДЕ
	|	ПоказателиДляМонитораРуководителя.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ПоказателиДляМонитораРуководителя.Организация В(&МассивОрганизаций)
	|	И ПоказателиДляМонитораРуководителя.МедицинскийЦентр = &МедицинскийЦентр
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ПоказателиДляМонитораРуководителя.Период, МЕСЯЦ),
	|	ПоказателиДляМонитораРуководителя.Показатель,
	|	ПоказателиДляМонитораРуководителя.Разрез,
	|	ПоказателиДляМонитораРуководителя.ТипУслуги,
	|	ПоказателиДляМонитораРуководителя.ТипОплаты,
	|	ПоказателиДляМонитораРуководителя.МедицинскийЦентр,
	|	ПоказателиДляМонитораРуководителя.Организация";
	
	
	Если ЗначениеЗаполнено(Филиал) Тогда
		МассивОрганизаций = Новый Массив;
		МассивОрганизаций.Добавить(Филиал);
	Иначе
		МассивОрганизаций = ПолучитьМассивОрганизаций();
	КонецЕсли;
	
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода);
	Запрос.УстановитьПараметр("КонецПериода", КонецГода);
	Запрос.УстановитьПараметр("МассивОрганизаций", МассивОрганизаций);
	Запрос.УстановитьПараметр("МедицинскийЦентр", МедицинскийЦентр);
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ПоказательСреднийЧек = Справочники.ПоказателиПланирования.СреднийЧек;
	ПоказательДоход = Справочники.ПоказателиПланирования.Доход;
	ПоказательКоличествоВизитов = Справочники.ПоказателиПланирования.КоличествоВизитов;
	ПоказательКоличествоУникальныхПациентов = Справочники.ПоказателиПланирования.КоличествоУникальныхПациентов;	
	ПоказательКоличествоПостоянныхПациентов = Справочники.ПоказателиПланирования.КоличествоПостоянныхПациентов;
	ПоказательПроцентПовторныхПосещений = Справочники.ПоказателиПланирования.ПроцентПовторныхПосещений;
	ПоказательПроцентПостоянныхКлиентов = Справочники.ПоказателиПланирования.ПроцентПостоянныхКлиентов;
	
	
		ГрафикДоходыСтатистика.Обновление = Ложь;
		ГрафикДоходыСтатистика.Очистить();
		ГрафикДоходыСтатистика.АвтоТранспонирование = Ложь;		
        //////////////////// 
		ГрафикСреднийЧекСтатистика.Обновление = Ложь;
		ГрафикСреднийЧекСтатистика.Очистить();
		ГрафикСреднийЧекСтатистика.АвтоТранспонирование = Ложь;		
        //////////////////// 
		ГрафикПосещенийСтатистика.Обновление = Ложь;
		ГрафикПосещенийСтатистика.Очистить();
		ГрафикПосещенийСтатистика.АвтоТранспонирование = Ложь;		

	Пока Выборка.Следующий() Цикл
			Если Выборка.Показатель = ПоказательДоход Тогда
		     	Точка = ГрафикДоходыСтатистика.УстановитьТочку(Выборка.Месяц);
				Точка.Текст = Формат(Выборка.Месяц,"ДФ=ММММ");
				Серия = ГрафикДоходыСтатистика.УстановитьСерию(Выборка.Организация);
				ГрафикДоходыСтатистика.УстановитьЗначение(Точка, Серия, Выборка.Значение);
            ИначеЕсли Выборка.Показатель = ПоказательСреднийЧек Тогда 
		        Точка = ГрафикСреднийЧекСтатистика.УстановитьТочку(Выборка.Месяц);
				Точка.Текст = Формат(Выборка.Месяц,"ДФ=ММММ");
				Серия = ГрафикСреднийЧекСтатистика.УстановитьСерию(Выборка.Организация);
				ГрафикСреднийЧекСтатистика.УстановитьЗначение(Точка, Серия, Выборка.Значение);
			ИначеЕсли Выборка.Показатель = ПоказательКоличествоВизитов Тогда 
		        Точка = ГрафикПосещенийСтатистика.УстановитьТочку(Выборка.Месяц);
				Точка.Текст = Формат(Выборка.Месяц,"ДФ=ММММ");
				Серия = ГрафикПосещенийСтатистика.УстановитьСерию(Выборка.Организация);
				ГрафикПосещенийСтатистика.УстановитьЗначение(Точка, Серия, Выборка.Значение);

             КонецЕсли;
     КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивОрганизаций()
        Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Организации.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Организации КАК Организации";
       	Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		МассивОрганизаций = Новый Массив;
        	Пока Выборка.Следующий() Цикл
                 МассивОрганизаций.Добавить(Выборка.Ссылка);
			 КонецЦикла;
	Возврат МассивОрганизаций;
	
КонецФункции
